Tekla.Structures.Drawing.WeldMark
The WeldMark class defines a drawing object that illustrates a weld mark in a specific view.
The following code modifies a weld mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class WeldMarkExample
{
public void WeldMarkModify()
{
DrawingHandler myDrawingHandler = new DrawingHandler();
DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
while (allObjectsOnSheet.MoveNext())
{
if (allObjectsOnSheet.Current is Tekla.Structures.Drawing.WeldMark)
{
WeldMark weldMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.WeldMark;
weldMark.Modify();
}
}
}
}

Tekla.Structures.Drawing.WeldMark.ModelIdentifier
Gets the model identifier related to the weld mark.

Tekla.Structures.Drawing.WeldMark.Modify
Modifies the weld mark in the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.WeldMark.Insert
NOT YET IMPLEMENTED.
Returns: False.